import React from 'react'
import levelToRgb from '../utils/levelToRgb'

const TowardsCard = ({level}) => {

    const towardsList = [ "Новичок" 
    ,"Воспитанник" 
    ,"Последователь" 
    ,"Адепт" 
    ,"Ученик физ-мат Лицея" 
    ,"Подмастерье" 
    ,"Любитель" 
    ,"Мастер" 
    ,"Гранд-Мастер" 
    ,"Гений" 
    ,"Илон Маск"
    ,"Стивен Хоккинг"]
    
    const themesList = ["Вселенная"
    ,"Движение"
    ,"Жизнь"
    ,"Материалы"
    ,"Материя"
    ,"Мозг"
    ,"Наука"
    ,"Энергия"
    ,"Язык и коммуникация"
    ,"IT"]

    return (
        <div>
            <svg
      xmlns="http://www.w3.org/2000/svg"
      x="0"
      y="0"
      width="100px"
      height="100px"
      enableBackground="new 0 0 477.905 477.905"
      version="1.1"
      viewBox="0 0 477.905 477.905"
      xmlSpace="preserve"
    >
      <path fill={`#${levelToRgb(level)}`} d="M476.343 183.008a34.134 34.134 0 00-28.314-24.149l-127.01-17.545-50.261-120.098C263.42 3.637 243.22-4.664 225.641 2.674A34.492 34.492 0 00207.1 21.215l-50.261 120.098-127.01 17.545C10.905 161.493-2.3 178.969.335 197.892a34.592 34.592 0 0011.249 21.058l95.693 85.333-19.661 133.906a34.133 34.133 0 0015.838 34.355 34.013 34.013 0 0037.7-.7l97.775-66.492 97.775 66.56c15.777 10.708 37.248 6.599 47.957-9.178a34.527 34.527 0 005.582-24.477l-19.661-133.956 95.693-85.333a34.29 34.29 0 0010.068-35.96z"></path>
            </svg>
            <h3>{themesList[level]}</h3>
            <h4>{towardsList[level]}</h4>
        </div>
    )
}

export default TowardsCard
